In [ ]:
# SQLite is a C library that provides a lightweight disk-based database that doesnâ€™t require a separate server process and allows

In [4]:
# In this tutorial, you will create a database of Monty Python movies using basic sqlite3 functionality. It assumes a fundamental understanding of database concepts, including cursors and transactions.

In [5]:
# First, we need to create a new database and open a database connection to allow sqlite3 to work with it.
# Call sqlite3.connect() to create a connection to the database tutorial.db in the current working directory, implicitly creating it if it does not exist:

In [1]:
import sqlite3

In [2]:
# !pip install pandas
import pandas as pd

In [3]:
con = sqlite3.connect('tutorial.db')

In [4]:
# In order to execute SQL statements and fetch results from SQL queries, we will need to use a database cursor.

In [5]:
cur = con.cursor()

In [6]:
# cur.execute("drop table movies")

In [7]:
result = cur.execute("create table movies(title,year,score)")

In [12]:
# After Creating table let's insert values into it

In [8]:
cur.execute(""" insert into movies values ('Monty Python and the Holy Grail', 1975, 8.2),
        ('And Now for Something Completely Different', 1971, 7.5)""")

In [9]:
# cur.execute("select * from movies").fetchone()
cur.execute("select * from movies").fetchall()

[('Monty Python and the Holy Grail', 1975, 8.2),
 ('And Now for Something Completely Different', 1971, 7.5)]

In [10]:
## What if we want to insert many values at a time
data = [
    ("Monty Python Live at the Hollywood Bowl", 1982, 7.9),
    ("Monty Python's The Meaning of Life", 1983, 7.5),
    ("Monty Python's Life of Brian", 1979, 8.0),
]
cur.executemany("insert into movies values(?, ?, ?)", data)
con.commit()  # Remember to commit the transaction after executing INSERT.

In [11]:
cur.execute("select * from movies").fetchall()

[('Monty Python and the Holy Grail', 1975, 8.2),
 ('And Now for Something Completely Different', 1971, 7.5),
 ('Monty Python Live at the Hollywood Bowl', 1982, 7.9),
 ("Monty Python's The Meaning of Life", 1983, 7.5),
 ("Monty Python's Life of Brian", 1979, 8.0)]

In [12]:
# Now I want to write query for printing the movies year wise
cur.execute("select * from movies order by year").fetchall()

[('And Now for Something Completely Different', 1971, 7.5),
 ('Monty Python and the Holy Grail', 1975, 8.2),
 ("Monty Python's Life of Brian", 1979, 8.0),
 ('Monty Python Live at the Hollywood Bowl', 1982, 7.9),
 ("Monty Python's The Meaning of Life", 1983, 7.5)]

In [13]:
# Using Pandas Data Frame the output of program will be much more appealing
pd.DataFrame(columns=["Title","Year","Score"],data=cur.execute("select * from movies order by year").fetchall())

                                        Title  Year  Score
0  And Now for Something Completely Different  1971    7.5
1             Monty Python and the Holy Grail  1975    8.2
2                Monty Python's Life of Brian  1979    8.0
3     Monty Python Live at the Hollywood Bowl  1982    7.9
4          Monty Python's The Meaning of Life  1983    7.5

In [14]:
# delete a row
cur.execute("delete from movies where score = (select min(Score) from movies)")

In [15]:
# Using Pandas Data Frame the output of program will be much more appealing
pd.DataFrame(columns=["Title","Year","Score"],data=cur.execute("select * from movies order by year").fetchall())

                                     Title  Year  Score
0          Monty Python and the Holy Grail  1975    8.2
1             Monty Python's Life of Brian  1979    8.0
2  Monty Python Live at the Hollywood Bowl  1982    7.9

In [16]:
# update a row
cur.execute("update movies set Score = 8.8 where Title ='Monty Python and the Holy Grail' ")

In [17]:
# Using Pandas Data Frame the output of program will be much more appealing
pd.DataFrame(columns=["Title","Year","Score"],data=cur.execute("select * from movies order by year").fetchall())

                                     Title  Year  Score
0          Monty Python and the Holy Grail  1975    8.8
1             Monty Python's Life of Brian  1979    8.0
2  Monty Python Live at the Hollywood Bowl  1982    7.9

In [33]:
# Movie with highest rating
pd.DataFrame(columns=["Movie", "Year", "Title"], data=cur.execute("select * from movies where score = (select max(score) from movies)").fetchall())

                             Movie  Year  Title
0  Monty Python and the Holy Grail  1975    8.2

In [34]:
# Movie with lowest rating
pd.DataFrame(columns=["Movie", "Year", "Title"], data=cur.execute("select * from movies where score = (select min(score) from movies)").fetchall())

                                        Movie  Year  Title
0  And Now for Something Completely Different  1971    7.5
1          Monty Python's The Meaning of Life  1983    7.5